grevaillot/svd_tools/headers/STM32H7B3x/i2c3.h
#pragma once 

/* --- I2C3: I2C3 --------------------------------------------------- */

/** @defgroup i2c3_registers I2C3 Register
@{*/

/** I2C3_I2C_CR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_I2C_CR1			MMIO32(I2C3_BASE + 0x00)
/** I2C3_I2C_CR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_I2C_CR2			MMIO32(I2C3_BASE + 0x04)
/** I2C3_I2C_OAR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_I2C_OAR1			MMIO32(I2C3_BASE + 0x08)
/** I2C3_I2C_OAR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_I2C_OAR2			MMIO32(I2C3_BASE + 0x0c)
/** I2C3_I2C_TIMINGR Access: No wait states **/
#define I2C3_I2C_TIMINGR			MMIO32(I2C3_BASE + 0x10)
/** I2C3_I2C_TIMEOUTR Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_I2C_TIMEOUTR			MMIO32(I2C3_BASE + 0x14)
/** I2C3_I2C_ISR Access: No wait states **/
#define I2C3_I2C_ISR			MMIO32(I2C3_BASE + 0x18)
/** I2C3_I2C_ICR Access: No wait states **/
#define I2C3_I2C_ICR			MMIO32(I2C3_BASE + 0x1c)
/** I2C3_I2C_PECR Access: No wait states **/
#define I2C3_I2C_PECR			MMIO32(I2C3_BASE + 0x20)
/** I2C3_I2C_RXDR Access: No wait states **/
#define I2C3_I2C_RXDR			MMIO32(I2C3_BASE + 0x24)
/** I2C3_I2C_TXDR Access: No wait states **/
#define I2C3_I2C_TXDR			MMIO32(I2C3_BASE + 0x28)

/**@}*/


/** @defgroup i2c3_i2c_cr1 I2CCR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C3_I2C_CR1_PECEN PEC enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_I2C_CR1_PECEN		(1 << 23)
/** I2C3_I2C_CR1_ALERTEN SMBus alert enable Device mode (SMBHEN=0): Host mode (SMBHEN=1): Note: When ALERTEN=0, the SMBA pin can be used as a standard GPIO. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_I2C_CR1_ALERTEN		(1 << 22)
/** I2C3_I2C_CR1_SMBDEN SMBus Device Default address enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_I2C_CR1_SMBDEN		(1 << 21)
/** I2C3_I2C_CR1_SMBHEN SMBus Host address enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_I2C_CR1_SMBHEN		(1 << 20)
/** I2C3_I2C_CR1_GCEN General call enable **/
#define I2C3_I2C_CR1_GCEN		(1 << 19)
/** I2C3_I2C_CR1_WUPEN Wakeup from Stop mode enable Note: If the Wakeup from Stop mode feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. Note: WUPEN can be set only when DNF = 0000 **/
#define I2C3_I2C_CR1_WUPEN		(1 << 18)
/** I2C3_I2C_CR1_NOSTRETCH Clock stretching disable This bit is used to disable clock stretching in slave mode. It must be kept cleared in master mode. Note: This bit can only be programmed when the I2C is disabled (PE = 0). **/
#define I2C3_I2C_CR1_NOSTRETCH		(1 << 17)
/** I2C3_I2C_CR1_SBC Slave byte control This bit is used to enable hardware byte control in slave mode. **/
#define I2C3_I2C_CR1_SBC		(1 << 16)
/** I2C3_I2C_CR1_RXDMAEN DMA reception requests enable **/
#define I2C3_I2C_CR1_RXDMAEN		(1 << 15)
/** I2C3_I2C_CR1_TXDMAEN DMA transmission requests enable **/
#define I2C3_I2C_CR1_TXDMAEN		(1 << 14)
/** I2C3_I2C_CR1_ANFOFF Analog noise filter OFF Note: This bit can only be programmed when the I2C is disabled (PE = 0). **/
#define I2C3_I2C_CR1_ANFOFF		(1 << 12)

#define I2C3_I2C_CR1_DNF_SHIFT		8
#define I2C3_I2C_CR1_DNF_MASK		0x0f
/** @defgroup i2c3_i2c_cr1_dnf DNF Digital noise filter These bits are used to configure the digital noise filter on SDA and SCL input. The digital filter will filter spikes with a length of up to DNF[3:0] * tI2CCLK ... Note: If the analog filter is also enabled, the digital filter is added to the analog filter. This filter can only be programmed when the I2C is disabled (PE = 0).
@{*/
/**@}*/

/** I2C3_I2C_CR1_ERRIE Error interrupts enable Note: Any of these errors generate an interrupt: Arbitration Loss (ARLO) Bus Error detection (BERR) Overrun/Underrun (OVR) Timeout detection (TIMEOUT) PEC error detection (PECERR) Alert pin event detection (ALERT) **/
#define I2C3_I2C_CR1_ERRIE		(1 << 7)
/** I2C3_I2C_CR1_TCIE Transfer Complete interrupt enable Note: Any of these events will generate an interrupt: Transfer Complete (TC) Transfer Complete Reload (TCR) **/
#define I2C3_I2C_CR1_TCIE		(1 << 6)
/** I2C3_I2C_CR1_STOPIE STOP detection Interrupt enable **/
#define I2C3_I2C_CR1_STOPIE		(1 << 5)
/** I2C3_I2C_CR1_NACKIE Not acknowledge received Interrupt enable **/
#define I2C3_I2C_CR1_NACKIE		(1 << 4)
/** I2C3_I2C_CR1_ADDRIE Address match Interrupt enable (slave only) **/
#define I2C3_I2C_CR1_ADDRIE		(1 << 3)
/** I2C3_I2C_CR1_RXIE RX Interrupt enable **/
#define I2C3_I2C_CR1_RXIE		(1 << 2)
/** I2C3_I2C_CR1_TXIE TX Interrupt enable **/
#define I2C3_I2C_CR1_TXIE		(1 << 1)
/** I2C3_I2C_CR1_PE Peripheral enable Note: When PE=0, the I2C SCL and SDA lines are released. Internal state machines and status bits are put back to their reset value. When cleared, PE must be kept low for at least 3 APB clock cycles. **/
#define I2C3_I2C_CR1_PE		(1 << 0)

/**@}*/

/** @defgroup i2c3_i2c_cr2 I2CCR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C3_I2C_CR2_PECBYTE Packet error checking byte This bit is set by software, and cleared by hardware when the PEC is transferred, or when a STOP condition or an Address matched is received, also when PE=0. Note: Writing 0 to this bit has no effect. This bit has no effect when RELOAD is set. This bit has no effect is slave mode when SBC=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_I2C_CR2_PECBYTE		(1 << 26)
/** I2C3_I2C_CR2_AUTOEND Automatic end mode (master mode) This bit is set and cleared by software. Note: This bit has no effect in slave mode or when the RELOAD bit is set. **/
#define I2C3_I2C_CR2_AUTOEND		(1 << 25)
/** I2C3_I2C_CR2_RELOAD NBYTES reload mode This bit is set and cleared by software. **/
#define I2C3_I2C_CR2_RELOAD		(1 << 24)

